export const MOVIE_GENRES: Record<number, string> = {
  28: 'Боевик',
  12: 'Приключения',
  16: 'Анимация',
  35: 'Комедия',
  80: 'Криминал',
  99: 'Документальный',
  18: 'Драма',
  10751: 'Семейный',
  14: 'Фэнтези',
  36: 'История',
  27: 'Ужасы',
  10402: 'Музыка',
  9648: 'Детектив',
  10749: 'Мелодрама',
  878: 'Фантастика',
  10770: 'ТВ-фильм',
  53: 'Триллер',
  10752: 'Война',
  37: 'Вестерн',
}

export const TV_GENRES: Record<number, string> = {
  10759: 'Боевик',
  16: 'Анимация',
  35: 'Комедия',
  80: 'Криминал',
  99: 'Документальный',
  18: 'Драма',
  10751: 'Семейный',
  10762: 'Детский',
  9648: 'Детектив',
  10763: 'Новости',
  10764: 'Реалити',
  10765: 'Фантастика',
  10766: 'Мелодрама',
  10767: 'Ток-шоу',
  10768: 'Политика',
  37: 'Вестерн',
}

export function getGenreNames(genreIds: number[], isTV = false): string[] {
  const map = isTV ? TV_GENRES : MOVIE_GENRES
  return genreIds
    .map((id) => map[id])
    .filter(Boolean)
    .slice(0, 3)
}
